# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Converts/uploads GPS waypoints, tracks, and routes
brew "gpsbabel"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Post-modern modal text editor
brew "helix"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# International Ispell
brew "ispell"
# YAML Parser
brew "libyaml"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Music engraving system
brew "lilypond"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Convert bitmaps to vector graphics
brew "potrace"
# Monitor data's progress through a pipe
brew "pv"
# Rsync for cloud storage
brew "rclone"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Terminal multiplexer
brew "tmux"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Open links in any browser
cask "choosy"
# Write, edit, and chat about your code with AI
cask "cursor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Utility that prevents the system from going to sleep
cask "domzilla-caffeine"
# Web browser
cask "firefox"
cask "font-atkinson-hyperlegible"
cask "font-atkinson-hyperlegible-mono"
cask "font-google-sans-code"
cask "font-open-sans"
cask "font-source-code-pro-for-powerline"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Graphical interface for LaTeX
cask "latexit"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Free and open-source RSS reader
cask "netnewswire"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# WebKit based web browser
cask "orion"
# Control your tools with a few keystrokes
cask "raycast"
# App that enables mouse-free UI interaction
cask "shortcat"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "Adblock Plus", id: 1432731683
mas "CCMenu", id: 603117688
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 361309726
mas "Pages", id: 409201541
mas "Tampermonkey", id: 6738342400
mas "Userscripts", id: 1463298887
vscode "bncummings.lytex-language-pack"
vscode "bncummings.lytex-language-support"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "orta.vscode-jest"
vscode "testdouble.vscode-standard-ruby"
uv "specify-cli"
