tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "railwaycat/emacsmacport"
tap "wallix/awless"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Official Amazon AWS command-line interface
brew "awscli"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Docker-machine completion script
brew "docker-machine-completion"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# AWS IAM import and export tool
brew "iamy"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Input filter for the pager less
brew "lesspipe"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Open source relational database management system
brew "mysql@5.6", restart_service: true, link: true
# Manage multiple NodeJS versions
brew "nodenv"
# Object-relational database system
brew "postgresql@9.6", restart_service: true, link: true
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A tool to manage rack apps in development with puma
brew "puma/puma/puma-dev"
# The Mighty CLI for AWS
brew "wallix/awless/awless"
cask "aws-vault"
cask "docker"
cask "gpg-suite"
cask "phantomjs"
cask "xquartz"
cask "railwaycat/emacsmacport/emacs-mac-spacemacs-icon"
