tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "railwaycat/emacsmacport"
tap "wallix/awless"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# Docker-machine completion script
brew "docker-machine-completion"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Distributed revision control system
brew "git"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Git extension to generate reports for standup meetings
brew "git-standup"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# The Haskell Tool Stack
brew "haskell-stack"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# AWS IAM import and export tool
brew "iamy"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# International Ispell
brew "ispell"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Input filter for the pager less
brew "lesspipe"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# GNOME XML library
brew "libxml2"
# Text-to-HTML conversion tool
brew "markdown"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Open source relational database management system
brew "mysql@5.6", restart_service: true
# Port scanning utility for large networks
brew "nmap"
# Manage multiple NodeJS versions
brew "nodenv"
# Object-relational database system
brew "postgresql@9.6", restart_service: true
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Sampling profiler for Ruby
brew "rbspy"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A tool to manage rack apps in development with puma
brew "puma/puma/puma-dev"
# The Mighty CLI for AWS
brew "wallix/awless/awless"
cask "aws-vault"
cask "dash"
cask "gpg-suite"
cask "phantomjs"
cask "postico"
cask "private-internet-access"
cask "riot"
cask "signal"
cask "spectacle"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
cask "railwaycat/emacsmacport/emacs-mac-spacemacs-icon"
